/*
	Drivers for SX1276
	Thanks to EC_ML51_LoRa_Control_V1.00(https://www.nuvoton.com/resource-download.jsp?tp_GUID=EC0120200103114211)
*/
#include <stdio.h>
#include <string.h>
#include <NuMicro.h>
#include "esensor.h"
#include "lora_packet.h"
#include "drivers_lora.h"

unsigned char SpiInOut(unsigned char outData);
void SX1276Init(void);
void SX1276InitIo(void);
void SX1276Reset(void);
void SX1276SetReset(unsigned char state);
void SX1276SetLoRaOn(void);
void SX1276LoRaSetOpMode(unsigned char opMode);
void SX1276Write(unsigned char addr, unsigned char data_in);
void SX1276WriteBuffer(unsigned char addr, unsigned char *buffer, unsigned char size_in);
void SX1276Read(unsigned char addr, unsigned char *data_in);
void SX1276ReadBuffer(unsigned char addr, unsigned char *buffer, unsigned char size_in);
void SX1276LoRaInit(void);
void SX1276LoRaSetDefaults(void);
void SX1276LoRaSetRFFrequency(unsigned long int freq);
void SX1276LoRaSetSpreadingFactor(unsigned char factor);
void SX1276LoRaSetErrorCoding(unsigned char value);
void SX1276LoRaSetPacketCrcOn(unsigned char enable);
void SX1276LoRaSetSignalBandwidth(unsigned char bw);
void SX1276LoRaSetImplicitHeaderOn(unsigned char enable);
void SX1276LoRaSetSymbTimeout(unsigned short int value);
void SX1276LoRaSetPayloadLength(unsigned char value);
void SX1276LoRaSetPreambleLength(unsigned short int value);
void SX1276LoRaSetLowDatarateOptimize(unsigned char enable);
void SX1276LoRaSetPAOutput(unsigned char outputPin);
void SX1276LoRaSetPa20dBm(unsigned char enale);
void SX1276LoRaSetRFPower(char power);
void SX1276LoRaSetNbTrigPeaks(unsigned char value);
void SX1276StartRx(void);
void SX1276LoRaSetRFState(unsigned char state);
void SX1276LoRaGetRxPacket(void *buffer, unsigned short int *size_in);
void SX1276LoRaSetTxPacket(const void *buffer, unsigned short int size_in);
void SX1276WriteFifo(unsigned char *buffer, unsigned char size_in);
void SX1276ReadFifo(unsigned char *buffer, unsigned char size_in);
double SX1276LoRaGetPacketRssi(void);

#define SPI_SS0_PIN																	PH7

/*!
 * Constant values need to compute the RSSI value
 */
#define RSSI_OFFSET_LF                              -164.0
#define RSSI_OFFSET_HF                              -157.0

/*!
 * RF packet definition
 */
#define RF_BUFFER_SIZE_MAX                          256
#define RF_BUFFER_SIZE                              256

/*!
 * SX1276 LoRa General parameters definition
 */
typedef struct sLoRaSettings
{
    unsigned long int RFFrequency;
    unsigned char Power;
    unsigned char SignalBw;                   // LORA [0: 7.8 kHz, 1: 10.4 kHz, 2: 15.6 kHz, 3: 20.8 kHz, 4: 31.2 kHz,
    // 5: 41.6 kHz, 6: 62.5 kHz, 7: 125 kHz, 8: 250 kHz, 9: 500 kHz, other: Reserved]
    unsigned char SpreadingFactor;            // LORA [6: 64, 7: 128, 8: 256, 9: 512, 10: 1024, 11: 2048, 12: 4096  chips]
    unsigned char ErrorCoding;                // LORA [1: 4/5, 2: 4/6, 3: 4/7, 4: 4/8]
    unsigned char CrcOn;                         // [0: OFF, 1: ON]
    unsigned char ImplicitHeaderOn;              // [0: OFF, 1: ON]
    unsigned char RxSingleOn;                    // [0: Continuous, 1 Single]
    unsigned char FreqHopOn;                     // [0: OFF, 1: ON]
    unsigned char HopPeriod;                  // Hops every frequency hopping period symbols
    unsigned long int TxPacketTimeout;
    unsigned long int RxPacketTimeout;
    unsigned char PayloadLength;
    unsigned char PreambleLength;               //Added by Joe
} tLoRaSettings;

typedef struct sSX1276LR
{
    unsigned char RegFifo;                                // 0x00
    // Common settings
    unsigned char RegOpMode;                              // 0x01
    unsigned char RegRes02;                               // 0x02
    unsigned char RegRes03;                               // 0x03
    unsigned char RegBandSetting;                         // 0x04
    unsigned char RegRes05;                               // 0x05
    unsigned char RegFrfMsb;                              // 0x06
    unsigned char RegFrfMid;                              // 0x07
    unsigned char RegFrfLsb;                              // 0x08
    // Tx settings
    unsigned char RegPaConfig;                            // 0x09
    unsigned char RegPaRamp;                              // 0x0A
    unsigned char RegOcp;                                 // 0x0B
    // Rx settings
    unsigned char RegLna;                                 // 0x0C
    // LoRa registers
    unsigned char RegFifoAddrPtr;                         // 0x0D
    unsigned char RegFifoTxBaseAddr;                      // 0x0E
    unsigned char RegFifoRxBaseAddr;                      // 0x0F
    unsigned char RegFifoRxCurrentAddr;                   // 0x10
    unsigned char RegIrqFlagsMask;                        // 0x11
    unsigned char RegIrqFlags;                            // 0x12
    unsigned char RegNbRxBytes;                           // 0x13
    unsigned char RegRxHeaderCntValueMsb;                 // 0x14
    unsigned char RegRxHeaderCntValueLsb;                 // 0x15
    unsigned char RegRxPacketCntValueMsb;                 // 0x16
    unsigned char RegRxPacketCntValueLsb;                 // 0x17
    unsigned char RegModemStat;                           // 0x18
    unsigned char RegPktSnrValue;                         // 0x19
    unsigned char RegPktRssiValue;                        // 0x1A
    unsigned char RegRssiValue;                           // 0x1B
    unsigned char RegHopChannel;                          // 0x1C
    unsigned char RegModemConfig1;                        // 0x1D
    unsigned char RegModemConfig2;                        // 0x1E
    unsigned char RegSymbTimeoutLsb;                      // 0x1F
    unsigned char RegPreambleMsb;                         // 0x20
    unsigned char RegPreambleLsb;                         // 0x21
    unsigned char RegPayloadLength;                       // 0x22
    unsigned char RegMaxPayloadLength;                    // 0x23
    unsigned char RegHopPeriod;                           // 0x24
    unsigned char RegFifoRxByteAddr;                      // 0x25
    unsigned char RegModemConfig3;                        // 0x26
    unsigned char RegTestReserved27;                      // 0x27
    unsigned char RegFeiMsb;                              // 0x28
    unsigned char RegFeiMib;                              // 0x29
    unsigned char RegFeiLsb;                              // 0x2A
    unsigned char RegTestReserved2B[0x30 - 0x2B + 1];        // 0x2B-0x30
    unsigned char RegDetectOptimize;                      // 0x31
    unsigned char RegTestReserved32;                      // 0x32
    unsigned char RegInvertIQ;                            // 0x33
    unsigned char RegTestReserved34[0x36 - 0x34 + 1];        // 0x34-0x36
    unsigned char RegDetectionThreshold;                  // 0x37
    unsigned char RegTestReserved38[0x3F - 0x38 + 1];        // 0x38-0x3F
    // I/O settings
    unsigned char RegDioMapping1;                         // 0x40
    unsigned char RegDioMapping2;                         // 0x41
    // Version
    unsigned char RegVersion;                             // 0x42
    // Test
    unsigned char RegTestReserved43;                      // 0x43
    // Additional settings
    unsigned char RegPllHop;                              // 0x44
    // Test
    unsigned char RegTestReserved45[0x4A - 0x45 + 1];        // 0x45-0x4A
    // Additional settings
    unsigned char RegTcxo;                                // 0x4B
    // Test
    unsigned char RegTestReserved4C;                      // 0x4C
    // Additional settings
    unsigned char RegPaDac;                               // 0x4D
    // Test
    unsigned char RegTestReserved4E[0x5A - 0x4E + 1];        // 0x4E-0x5A
    // Additional settings
    unsigned char RegFormerTemp;                          // 0x5B
    // Test
    unsigned char RegTestReserved5C;                      // 0x5C
    // Additional settings
    unsigned char RegBitrateFrac;                         // 0x5D
    // Additional settings
    unsigned char RegTestReserved5E[0x60 - 0x5E + 1];        // 0x5E-0x60
    // Additional settings
    unsigned char RegAgcRef;                              // 0x60
    unsigned char RegAgcThresh1;                          // 0x61
    unsigned char RegAgcThresh2;                          // 0x62
    unsigned char RegAgcThresh3;                          // 0x63
    // Test
    unsigned char RegTestReserved64[0x70 - 0x64 + 1];        // 0x64-0x70
} tSX1276LR;

/*!
 * SX1276 LoRa registers variable
 */
tSX1276LR *SX1276LR;

/*!
 * Local RF buffer for communication support
 */
static unsigned char RFBuffer[RF_BUFFER_SIZE];

/*!
 * Tx management support variables
 */
static unsigned int TxPacketSize = 0;

/*!
 * Rx management support variables
 */
static unsigned int RxPacketSize = 0;
static char RxPacketSnrEstimate;
static double RxPacketRssiValue;
static unsigned char RxGain = 1;

static unsigned char LoRaOnState = FALSE;

/*!
 * RF state machine variable
 */
static unsigned char RFLRState = RFLR_STATE_IDLE;

/*!
 * SX1276 registers variable
 */
unsigned char SX1276Regs[0x70] = {0};

unsigned char F_RxStart = FALSE;
unsigned char F_TxStart = FALSE;

/*!
 * Frequency hopping frequencies table
 */
const unsigned long int HoppingFrequencies[] =
{
    470500000
};

tLoRaSettings LoRaSettings =
{
    470500000,        // RFFrequency
